experimental_cases/chen_brooks/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format    ascii;
    class    dictionary;
    location    "constant";
    object    thermophysicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include    "$FOAM_CASE/constant/globalVars";

thermoType
{
    type    heRhoThermo;
    mixture    multiComponentMixture;
    transport    const;
    thermo    hConst;
    equationOfState    rhoConst;
    specie    specie;
    energy    sensibleInternalEnergy;
}

species
(
    O2
    water
);

inertSpecie    water;

water
{
    specie
    {
        molWeight    18.0153;
    }
    equationOfState
    {
        rho    $rho0MixLiq;
    }
    thermodynamics
    {
        Cp    $CpMixLiq;
        Hf    -15879000.0;
    }
    transport
    {
        mu    $muMixLiq;
        Pr    $PrMixLiq;
    }
}

CO2
{
    specie
    {
        molWeight    44.00995;
    }
    equationOfState
    {
        rho    $rho0MixLiq;
    }
    thermodynamics
    {
        Cp    $CpMixLiq;
        Hf    -1.5879e+07;
    }
    transport
    {
        mu    $muMixLiq;
        Pr    $PrCO2;
    }
}

O2
{
    specie
    {
        molWeight    31.999;
    }
    equationOfState
    {
        rho    $rho0MixLiq;
    }
    thermodynamics
    {
        Hf    -365639.0;
        Cp    $CpMixLiq;
    }
    transport
    {
        mu    $muMixLiq;
        Pr    $PrMixLiq;
    }
}

H2
{
    specie
    {
        molWeight    2.01594;
    }
    equationOfState
    {
        rho    $rho0MixLiq;
    }
    thermodynamics
    {
        Cp    $CpMixLiq;
        Hf    -1.5879e+07;
    }
    transport
    {
        mu    $muMixLiq;
        Pr    $PrH2;
    }
}

// ************************************************************************* //
